'use strict';
// 1) Спрашиваем у пользователя “Ваш месячный доход?” и результат сохраняем в переменную money
let money = +prompt('Ваш месячный доход?'), 
    mission = 3000000, 
    income = 'фриланс', 
    /* 2) Спросить у пользователя “Перечислите возможные расходы за рассчитываемый период через запятую”
      сохранить в переменную addExpenses, вывести в консоль в виде массива */
    addExpenses = prompt('Перечислите возможные расходы за рассчитываемый период через запятую'), 
    /*3) Спросить у пользователя “Есть ли у вас депозит в банке?” и сохранить данные в переменной deposit
     (булевое значение true/falsе)*/
    deposit = confirm('Есть ли у вас депозит в банке?'), 
    period = 12,
    // усложненное- Создать переменную num со значением 266219
    num = 266219,
    budgetDay ,
    budgetMonth,
  /*  5) Спросить у пользователя по 2 раза каждый вопрос и записать ответы в переменные  
        “Какие обязательные ежемесячные расходы у вас есть?” 
        “Во сколько это обойдется?”  
      в итоге 4 вопроса и 4 переменных*/
    spending = prompt('Какие обязательные ежемесячные расходы у вас есть?'),
    amount = +prompt('Во сколько это обойдется?'), 
    spending2 = prompt('Какие обязательные ежемесячные расходы у вас есть?'),
    amount2 = +prompt('Во сколько это обойдется?'),
    incomeLevel;

//  2)  вывести в консоль в виде массива 
console.log(addExpenses.split(', '));  
// 4) Вывести в консоль типы данных money, income, deposit
console.log("money:", typeof  money);
console.log("income:", typeof income);
console.log("deposit:", typeof deposit);
/* 6) Вычислить доход за месяц, учитывая обязательные расходы, сохранить в переменную budgetMonth
 и вывести результат в консоль*/
console.log(budgetMonth = money - amount - amount2);
/* 7) Зная budgetMonth, посчитать за сколько месяцев будет достигнута цель mission, вывести
 в консоль, округляя в большую сторону*/
 console.log("Колличество месяцев для достижения mission:", Math.ceil(mission / budgetMonth));

 /*8) Поправить budgetDay учитывая бюджет на месяц, а не месячный доход. Вывести в консоль 
  округлив в меньшую сторону (методы объекта Math в помощь)*/
  console.log(Math.floor(budgetDay = budgetMonth / 30 ));

/*  9) Написать конструкцию условий:		
      Если budgetDay больше 800, то “Высокий уровень дохода”
      Если budgetDay больше 300 и меньше 800, то сообщение “Средний уровень дохода”
      Если budgetDay больше 0 и меньше 300 то в консоль вывести сообщение “Низкий уровень дохода”
      Если отрицательное значение то вывести “Что то пошло не так”
      учесть варианты 0, 300 и 800*/
      if (budgetDay >= 800) {
        console.log('Высокий уровень дохода');
      } 
      if (budgetDay >= 300 && budgetDay < 800) {
        console.log('Средний уровень дохода');
      } 
      if (budgetDay >= 0 && budgetDay < 300) {
        console.log('Низкий уровень дохода');
      } 
      if (budgetDay < 0) {
        console.log('Что то пошло не так');
      }




